
# Token telegran bot
bot_token = '1567497617:AAFSdPESPvAYj8fJI-rSpBsZ3_L0CKaHG1s' # токен бота
CHANNEL_ID = 0 # id канала куда будет отсылаться информация, ид без -100 в начале (например: 124873248)

# ID admin
admin_id = 759337345 # id админа

bot_login = 'login' # логин бота
ref_percent = 5 # Процент реферальной системы

QIWI_NUMBER = '+79631210191'    # номер киви
QIWI_TOKEN = 'token'            # токен киви

text_purchase = '❕ Вы выбрали: ' \
                '{name}\n\n' \
                '{info}\n\n' \
                '💠 Цена: {price} рублей\n' \
                '💠 Кол-во товара: {amount}' \

#реклама
ads = '🚀Покупай рекламу🚀'

# инфа
info = '''❗️ Информация:\n
❗️ Это shop-бот, по поводу рекламы писать @min1168'''

# Пополнение баланса
replenish_balance = '⚠️ Пополнение баланса\n\n' \
                    '🥝 Оплата киви: \n\n' \
                    '👉 Номер  {number}\n' \
                    '👉 Коментарий  {code}\n' \
                    '👉 Сумма  от 1 до 15000 рублей'

# Профиль
profile = '🧾 Профиль\n\n' \
          '❕ Ваш id - {id}\n' \
          '❕ Ваш логин - {login}\n' \
          '❕ Дата регистрации - {data}\n\n' \
          '💰 Ваш баланс - {balance} рублей'


info2 = """
🎉 Пользователей [всего] - {}
🎉 Товара продано [сегодня] - {}
🎉 Доход [сегодня] - {}
"""